
===========================================================================
report_tns
============================================================================
tns -119.38

===========================================================================
report_wns
============================================================================
wns -6.29

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -6.29

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.17
