
===========================================================================
report_tns
============================================================================
tns -105.00

===========================================================================
report_wns
============================================================================
wns -5.69

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -5.69

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.17
