
===========================================================================
report_tns
============================================================================
tns -75.87

===========================================================================
report_wns
============================================================================
wns -3.26

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -3.26

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.17
