
===========================================================================
report_tns
============================================================================
tns -149.82

===========================================================================
report_wns
============================================================================
wns -6.84

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -6.84

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.17
