
===========================================================================
report_tns
============================================================================
tns -102.10

===========================================================================
report_wns
============================================================================
wns -3.31

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -3.31

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.17
